app/views/profiles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "links".* FROM "links"
---
        <h4> My latest blabs </h4>
        <% @profile.user.links.each do |link| %>