app/views/links/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", "1"]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", "1"]]
---
  <!-- counts amount of comments for the particular link -->
  <%= @link.comments.count %> Comments