app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["link_id", "1"], ["user_id", 2], ["created_at", "2015-07-18 14:52:09.037527"], ["updated_at", "2015-07-18 14:52:09.037527"]]
---
  def create
    # finding the link using the parameter
    @link = Link.find(params[:link_id])
    # assigning the link to the comment using the comment parameter
    @comment = @link.comments.new(comment_params)
    # assiging the comment to the current user
    @comment.user = current_user

    # @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save