app/controllers/links_controller.rb

SELECT "links".* FROM "links"  ORDER BY links.updated_at DESC
SELECT "locations".* FROM "locations"
---
  def index
    # pulls all links vailable from the database
    @links = Link.all.order("links.updated_at DESC")
    # pulls all the locaton data from the databse to use in the links index page
    @locations = Location.all

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "second link with user added"], ["url", "www.facebook.com"], ["user_id", 1], ["created_at", "2015-07-17 18:46:58.995315"], ["updated_at", "2015-07-17 18:46:58.995315"]]
---
  def create
    # @link = Link.new(link_params)
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["image_file_name", "IMG_0969.JPG"], ["image_file_size", 2771379], ["image_updated_at", "2015-07-18 18:51:33.713570"], ["updated_at", "2015-07-18 18:51:37.444659"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
    # find link using parameter id
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
---
  def downvote
     # find link using parameter id
    @link = Link.find(params[:id])