app/controllers/locations_controller.rb

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 53.3498053) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -6.2603097) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 53.3498053 AND locations.longitude >= -6.2603097) THEN  45.0 WHEN (locations.latitude <  53.3498053 AND locations.longitude >= -6.2603097) THEN 135.0 WHEN (locations.latitude <  53.3498053 AND locations.longitude <  -6.2603097) THEN 225.0 WHEN (locations.latitude >= 53.3498053 AND locations.longitude <  -6.2603097) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 52.62614638444576 AND 54.07346421555424 AND locations.longitude BETWEEN -7.472614967105531 AND -5.048004432894468)  ORDER BY distance ASC
---
  def index
    # if the search param is present then serach for nearby locations, dstance 50 miles order by distance
    if params[:search].present?
      @locations = Location.near(params[:search], 50)
    else
      # else show all locations available
      @locations = Location.all

INSERT INTO "locations" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "dublin, ireland"], ["latitude", 53.3498053], ["longitude", -6.2603097], ["created_at", "2015-07-20 09:42:31.751607"], ["updated_at", "2015-07-20 09:42:31.751607"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 53.3498053) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -6.2603097) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 53.3498053 AND locations.longitude >= -6.2603097) THEN  45.0 WHEN (locations.latitude <  53.3498053 AND locations.longitude >= -6.2603097) THEN 135.0 WHEN (locations.latitude <  53.3498053 AND locations.longitude <  -6.2603097) THEN 225.0 WHEN (locations.latitude >= 53.3498053 AND locations.longitude <  -6.2603097) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 53.20507351688915 AND 53.49453708311085 AND locations.longitude BETWEEN -6.502770753421106 AND -6.017848646578893 AND locations.id != 1)  ORDER BY distance ASC
---
    def set_location
      @location = Location.find(params[:id])