app/controllers/profiles_controller.rb

SELECT "links".* FROM "links"
---
  def show
    @links = Link.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    user = User.find(params[:id])

INSERT INTO "profiles" ("firstname", "lastname", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "bio", "city", "gender", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "avatar_updated_at" = ?, "avatar_file_name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["avatar_updated_at", "2015-07-22 00:34:36.249091"], ["avatar_file_name", "iambradley_Profile.jpeg"], ["updated_at", "2015-07-22 00:34:36.537631"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 2]]
---
  def signedinuserprofile
    profile = Profile.find_by_user_id(current_user.id)